blog.org
#+hugo_base_dir: ./
#+hugo_section: posts
#+hugo_code_fence: nil
#+startup: overview
** AoC 2023, Day 5, Fertilizer :AoC:advent:code:fsharp:
:PROPERTIES:
:EXPORT_FILE_NAME: aoc-2023-05
:EXPORT_DATE: <2023-12-11 Mon 05:17>
:END:

I am currently quite a few days behind.
I will try catching up bit by bit.

My first attempt at the Day 5 puzzle, called [[https://adventofcode.com/2023/day/5][If You Give A Seed A Fertilizer]] did not go so well, so this is my second attempt.

*** Part 1
#+begin_src fsharp :session aoc-2023-05 :exports code
let sampleText =
    "seeds: 79 14 55 13

seed-to-soil map:
50 98 2
52 50 48

soil-to-fertilizer map:
0 15 37
37 52 2
39 0 15

fertilizer-to-water map:
49 53 8
0 11 42
42 0 7
57 7 4

water-to-light map:
88 18 7
18 25 70

light-to-temperature map:
45 77 23
81 45 19
68 64 13

temperature-to-humidity map:
0 69 1
1 0 69

humidity-to-location map:
60 56 37
56 93 4"
#+end_src

I want to create a couple of types, a map entry type and a map type, this is to hold the input data. \\
Some of the numbers on the actual data are quite high, and there are no negatives, so I chose to use ~uint~ values.
#+begin_src fsharp :session aoc-2023-05 :exports code
type MapEntry = MapEntry of destination: uint * source: uint * length: uint
type Map = Map of MapEntry list
#+end_src

I need a few functions to parse the text into data types.
#+begin_src fsharp :session aoc-2023-05 :exports code
let parseSeeds (text: string) =
    text.Split(':').[1].Split(' ')
        |> Array.filter (fun x -> x.Length > 0)
        |> Array.map uint

let parseMapEntry (text: string) =
     if (System.Char.IsDigit text[0]) then
         let [|d;s;l|] = text.Split(' ') |> Array.map uint
         Some (MapEntry (d, s, l))
     else None

let parseAllMaps (texts: string[]) =
    let rec maps allMaps currentMap i =
        if i < texts.Length then
            match parseMapEntry texts[i], currentMap with
            | Some r, _ -> maps allMaps (currentMap@[r]) (i + 1)
            | None, [] -> maps allMaps [] (i + 1)
            | None, m -> maps (allMaps@[Map m]) [] (i + 1)
        else match currentMap with
             | [] -> allMaps
             | _ -> allMaps@[Map currentMap]
    maps [] [] 1

let parseAll (text: string) =
    let lines =
        text.Split('\n') |> Array.filter (fun x -> x.Length > 0)
    let seeds = parseSeeds lines[0]
    let maps = parseAllMaps lines
    seeds, maps
#+end_src

I want a function that will be able to lookup the destination from a map.
#+begin_src fsharp :session aoc-2023-05 :exports code
let findDestination (Map entries) source =
    entries
    |> Seq.filter (fun (MapEntry (_, s, _)) -> s <= source)
    |> Seq.filter (fun (MapEntry (_, s, l)) -> s + l >= source)
    |> Seq.map (fun (MapEntry (d, s, _)) -> d + source - s)
    |> Seq.tryHead
    |> Option.defaultValue source
#+end_src

And another that will step through each map.
#+begin_src fsharp :session aoc-2023-05 :exports code
let rec findFinalDestination maps source =
    match maps with
    | [] -> source
    | [ map ] -> findDestination map source
    | map :: rest -> findFinalDestination rest (findDestination map source)
#+end_src

Putting this all together
#+begin_src fsharp :session aoc-2023-05 :exports both
let result =
    let (seeds, maps) =
        sampleText
        |> parseAll

    seeds
    |> Array.map (findFinalDestination maps)
    |> Array.min
#+end_src

Because ~35~ is the answer I am expecting, and my answer with the full puzzle text is also correct, I finally get another star.


